testsuite_results/sysbench/results/oltp_delete.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 5163.97 qps: 5163.97 (r/w/o: 0.00/4442.01/721.96) lat (ms,95%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5365.15 qps: 5365.15 (r/w/o: 0.00/3539.85/1825.30) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5250.94 qps: 5250.99 (r/w/o: 0.00/2794.95/2456.05) lat (ms,95%): 15.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           213809
        other:                           105108
        total:                           318917
    transactions:                        318917 (5314.50 per sec.)
    queries:                             318917 (5314.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5314.5003
    time elapsed:                        60.0090s
    total number of events:              318917

Latency (ms):
         min:                                    2.70
         avg:                                   12.04
         max:                                   69.64
         95th percentile:                       15.00
         sum:                              3840243.66

Threads fairness:
    events (avg/stddev):           4982.9375/9.94
    execution time (avg/stddev):   60.0038/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 5597.60 qps: 5597.60 (r/w/o: 0.00/2283.96/3313.64) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 5787.90 qps: 5787.90 (r/w/o: 0.00/1784.65/4003.25) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 5952.75 qps: 5952.75 (r/w/o: 0.00/1441.60/4511.15) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           108009
        other:                           239919
        total:                           347928
    transactions:                        347928 (5797.34 per sec.)
    queries:                             347928 (5797.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5797.3370
    time elapsed:                        60.0153s
    total number of events:              347928

Latency (ms):
         min:                                    2.59
         avg:                                   11.04
         max:                                   39.27
         95th percentile:                       13.70
         sum:                              3840454.81

Threads fairness:
    events (avg/stddev):           5435.7500/18.51
    execution time (avg/stddev):   60.0071/0.01